In [ ]:
# Instalación de los paquetes necesarios para la ejecución de sql
! pip install ipython-sql psycopg2-binary psycopg2

In [1]:
import sqlalchemy
# Reemplazar las credenciales de acceso a la base de datos
sqlalchemy.create_engine("postgresql://postgres:postgres@localhost:5432/")
%load_ext sql
%sql postgresql://postgres:postgres@localhost:5432/

Utilizar los bloques con el header `%%sql` para ejecutar código SQL en la base de datos.

```sql
%%sql

SELECT * 
FROM table_name
WHERE condition
```

# Set de datos de departamentos, materias, estudiantes y notas

Lo pueden encontrar en: https://www.db-fiddle.com/f/bibZaujmJ5CEokquVcuG3h/0

- departamentos

| `codigo (PK)` | `nombre` |
| --- | --- |
| `integer (NOT NULL)` | `varchar(30) (NOT NULL)` |

- Materias
  - `PK: (codigo, numero)`
  - `FK: codigo -> departamentos.codigo`

| `codigo` | `numero` | `nombre` |
| --- | --- | --- |
| `integer (NOT NULL)` | `integer (NOT NULL)` | `varchar(30) (NOT NULL)` |


- estudiantes

| `padron (PK)` | `nombre` | `apellido` | `intercambio` | `fecha_ingreso` |
| --- | --- | --- | --- | --- |
| `integer (NOT NULL)` | `varchar(30) (NOT NULL)` | `varchar(30) (NOT NULL)` | `boolean (NOT NULL)` | `date (NOT NULL)` |

- notas
  - `PK: (padron, codigo, numero, fecha)`
  - `FK: padron -> estudiantes.padron`
  - `FK: (codigo, numero) -> materias.(codigo, numero)`

| `padron` | `codigo` | `numero` | `fecha` | `nota` |
| --- | --- | --- | --- | --- |
| `integer (NOT NULL)` | `integer (NOT NULL)` | `integer (NOT NULL)` | `date (NOT NULL)` | `integer (NOT NULL)` |

In [4]:
%%sql

-- Por si se modificaron los datos
DROP TABLE IF EXISTS notas;
DROP TABLE IF EXISTS materias;
DROP TABLE IF EXISTS departamentos;
DROP TABLE IF EXISTS inscripto_en;
DROP TABLE IF EXISTS carreras;
DROP TABLE IF EXISTS estudiantes;

CREATE TABLE departamentos (
    codigo INTEGER NOT NULL,
    nombre VARCHAR(30) NOT NULL,
    CONSTRAINT pk_departamentos PRIMARY KEY (codigo)
);
INSERT INTO DEPARTAMENTOS (codigo , nombre) 
    VALUES (71,'Gestión'),(75,'Computación');
CREATE TABLE materias (
    codigo INTEGER NOT NULL,
    numero INTEGER NOT NULL,
    nombre VARCHAR(30) NOT NULL,
    CONSTRAINT pk_materias PRIMARY KEY 
        (codigo, numero),
    CONSTRAINT fk_materia_depto FOREIGN KEY (codigo) 
        REFERENCES departamentos (codigo)
        ON UPDATE RESTRICT ON DELETE RESTRICT
);
INSERT INTO MATERIAS (codigo, numero, nombre) VALUES
    (71 , 14, 'Modelos y Optimización I') ,
    (71 , 15, 'Modelos y Optimización II') ,
    (75 , 1, 'Computación') ,
    (75 , 6, 'Organización de Datos') ,
    (75 , 15, 'Base de datos');
CREATE TABLE estudiantes (
    padron INTEGER NOT NULL,
    nombre VARCHAR(30) NOT NULL,
    apellido VARCHAR(30) NOT NULL,
    intercambio BOOLEAN NOT NULL DEFAULT FALSE,
    fecha_ingreso DATE NOT NULL,
    CONSTRAINT pk_estudiantes PRIMARY KEY (padron)
);
INSERT INTO estudiantes (padron, nombre, apellido, intercambio, fecha_ingreso) VALUES
    (71000,'Daniel','Molina',false,'2010-03-01') ,
    (72000,'Paula','Pérez Alonso',false,'2010-08-02') ,
    (73000,'José Agustín','Molina',true,'2011-03-07') ,
    (74000,'Miguel','Mazzeo',false,'2011-03-07') ,
    (75000,'Clemente','Onelli',false,'2011-03-07') ,
    (76000,'Graciela','Lecube',true,'2011-08-01');
CREATE TABLE notas (
    padron INTEGER NOT NULL,
    codigo INTEGER NOT NULL,
    numero INTEGER NOT NULL,
    fecha DATE NOT NULL,
    nota INTEGER NOT NULL,
    CONSTRAINT pk_notas PRIMARY KEY
        (padron, codigo, numero, fecha),
    CONSTRAINT fk_nota_estudiante FOREIGN KEY (padron) 
        REFERENCES estudiantes (padron) 
        ON UPDATE RESTRICT ON DELETE RESTRICT,
    CONSTRAINT fk_nota_materia FOREIGN KEY 
        (codigo, numero) REFERENCES materias 
        (codigo, numero)
        ON UPDATE RESTRICT ON DELETE RESTRICT
);
INSERT INTO NOTAS (padron, codigo, numero, nota, fecha) VALUES
    (73000, 71, 14, 5, '2013-12-09'), 
    (73000, 71, 15, 9, '2014-07-07'), 
    (73000, 75, 1, 5, '2010-07-14'), 
    (73000, 75, 6, 10, '2012-07-18'), 
    (73000, 75, 15, 4, '2013-07-10'), 
    (72000, 71, 14, 6, '2013-07-08'), 
    (72000, 71, 15, 2, '2013-12-09'), 
    (72000, 75, 1, 4, '2010-12-16'),
    (72000, 75, 6, 4, '2012-07-25'), 
    (72000, 75, 15, 1, '2013-07-10'), 
    (72000, 75, 15, 6, '2013-07-17'), 
    (75000, 71, 14, 7, '2013-12-16'), 
    (75000, 71, 15, 2, '2014-07-07'), 
    (75000, 75, 1, 8, '2010-07-21'), 
    (75000, 75, 6, 7, '2012-07-11'), 
    (75000, 75, 15, 2, '2013-07-24'), 
    (71000, 71, 14, 4, '2013-12-09'), 
    (71000, 75, 1, 4, '2010-12-16'), 
    (71000, 75, 6, 2, '2012-07-18'), 
    (71000, 75, 6, 6, '2012-07-25'), 
    (71000, 75, 15, 7, '2013-07-10'), 
    (76000, 75, 15, 2, '2013-07-17'), 
    (76000, 75, 15, 10, '2013-07-24'); 
CREATE TABLE carreras (
    codigo INTEGER NOT NULL,
    nombre CHARACTER(40) NOT NULL,
    CONSTRAINT pk_carreras PRIMARY KEY (codigo)
);
INSERT INTO carreras (codigo,nombre)VALUES
    (7, 'Ingeniería Electrónica'), 
    (9, 'Licenciatura en Análisis de Sistemas'), 
    (10, 'Ingeniería en Informática');
CREATE TABLE inscripto_en (
    padron INTEGER NOT NULL,
    codigo INTEGER NOT NULL,
    CONSTRAINT pk_inscripto_en PRIMARY KEY 
        (padron, codigo) ,
    CONSTRAINT fk_inscripto_padron FOREIGN KEY 
        (padron) REFERENCES estudiantes (padron)
        ON UPDATE RESTRICT ON DELETE RESTRICT,
    CONSTRAINT fk_inscripto_carrera FOREIGN KEY 
        (codigo) REFERENCES carreras (codigo)
        ON UPDATE RESTRICT ON DELETE RESTRICT
);
INSERT INTO inscripto_en (padron, codigo) VALUES
    (71000,10) , (72000,10) , (73000,9) ,(73000,10),
    (74000,10) , (75000,9) , (76000,9);

 * postgresql://postgres:***@localhost:5432/
Done.
Done.
Done.
Done.
Done.
Done.
Done.
2 rows affected.
Done.
5 rows affected.
Done.
6 rows affected.
Done.
23 rows affected.
Done.
3 rows affected.
Done.
7 rows affected.

[]

In [70]:
%%sql

select *
from materias

 * postgresql://postgres:***@localhost:5432/
5 rows affected.

[(71, 14, 'Modelos y Optimización I'),
 (71, 15, 'Modelos y Optimización II'),
 (75, 1, 'Computación'),
 (75, 6, 'Organización de Datos'),
 (75, 15, 'Base de datos')]

## División

Obtener los padrones de los estudiantes que tienen notas en todas las materias.

- **Definición**

In [13]:
%%sql

select distinct padron
from notas

except

select padron
from (
    select n.padron, m.codigo, m.numero
    from notas n, materias m
    
    except

    select padron, codigo, numero
    from notas
) nm

 * postgresql://postgres:***@localhost:5432/
3 rows affected.

[(72000,), (73000,), (75000,)]


- **Double NOT EXISTS**

In [48]:
%%sql

select a.padron
from estudiantes a
where not exists (
    select 'Que no haya materia'
    from materias m
    where not exists (
        select 'Que no haya nota para esa materia y alumno'
        from notas n
        where n.padron = a.padron
            and n.codigo = m.codigo 
            and n.numero = m.numero
    )
)

 * postgresql://postgres:***@localhost:5432/
3 rows affected.

[(72000,), (73000,), (75000,)]

- **RESTA de conjuntos**

In [12]:
%%sql

select padron
from estudiante a
where not exists (
    select codigo, numero
    from materias

    except

    select codigo, numero
    from notas n
    where n.padron = a.padron
)

 * postgresql://postgres:***@localhost:5432/
3 rows affected.

[(72000,), (73000,), (75000,)]

- **Agrupamiento**

In [64]:
%%sql

select padron, count(distinct (codigo::varchar || numero::varchar))
from notas
group by padron

 * postgresql://postgres:***@localhost:5432/
5 rows affected.

[(71000, 4), (72000, 5), (73000, 5), (75000, 5), (76000, 1)]

In [74]:
%%sql

select n.padron
from notas n
group by n.padron
having count(distinct codigo::varchar || numero::varchar) = (
    select count(*)
    from materias
)

 * postgresql://postgres:***@localhost:5432/
3 rows affected.

[(72000,), (73000,), (75000,)]